import matplotlib.pyplot as plt

# Данные
num_keys = [
    100, 200, 300, 400, 500, 600, 700, 800, 900, 1000,
    1100, 1200, 1300, 1400, 1500, 1600, 1700, 1800, 1900, 2000,
    2100, 2200, 2300, 2400
]
heights = [
    100, 200, 300, 400, 500, 600, 700, 800, 900, 1000,
    1100, 1200, 1300, 1400, 1500, 1600, 1700, 1800, 1900, 2000,
    2100, 2200, 2300, 2400
]

# Построение графика
plt.figure(figsize=(10, 6))
plt.plot(num_keys, heights, marker='o', label='BST Tree', color='b')

# Настройки графика
plt.title("Зависимость высоты от количества ключей")
plt.xlabel("Количество ключей")
plt.ylabel("Высота")
plt.grid(True, linestyle='--', alpha=0.6)
plt.legend()

# Показать график
plt.show()
